{
  "title": "Espai d'experimentació amb Xarxes Neuronals",
  "header": {
    "title": "Experimenta amb una <b>Xarxa Neuronal</b> <span class='optional'>aquí mateix </span>al teu navegador.<br>No et preocupis, no es trencarà. T'ho prometem."
  },
  "controls": {
    "epoch": "Època",
    "learningRate": "Taxa d'aprenentatge",
    "activation": "Activació",
    "relu": "ReLU",
    "tanh": "Tanh",
    "sigmoid": "Sigmoide",
    "linear": "Lineal",
    "regularization": "Regularització",
    "none": "Cap",
    "L1": "L1",
    "L2": "L2",
    "regularizationRate": "Taxa de regularització",
    "problemType": "Tipus de problema",
    "classification": "Classificació",
    "regression": "Regressió",
    "playButton": "Botó de play",
    "stepButton": "Botó d'avançar",
    "resetButton": "Botó de reset"
  },
  "data": {
    "title": "Dades",
    "whichDataset": "Quin conjunt de dades vols utilitzar?",
    "whichDatasetShort": "Conjunt de dades",
    "circle": "Cercle",
    "exclusiveOr": "XOR",
    "gaussian": "Gaussià",
    "spiral": "Espiral",
    "plane": "Pla",
    "multiGaussian": "Multi gaussià",
    "percTrainData": "Proporció de dades d'entrenament a dades de prova:",
    "percTrainDataShort": "Proporció de dades",
    "noise": "Soroll",
    "batchSize": "Mida del lot",
    "regenerate": "Regenerar"
  },
  "features": {
    "title": "Característiques",
    "description": "Quines propietats vols introduir?",
    "neuronOutput": "Aquesta és la sortida d'una <b>neurona</b>. Passa el ratolí per sobre per veure-la més gran.",
    "weightMixing": "Les sortides es barregen amb diferents <b>pesos</b>, mostrats pel gruix de les línies."
  },
  "hiddenLayers": {
    "singular": "Capa oculta",
    "plural": "Capes ocultes"
  },
  "neuron": {
    "singular": "neurona",
    "plural": "neurones"
  },
  "output": {
    "title": "Sortida",
    "testLoss": "Pèrdua de prova",
    "trainingLoss": "Pèrdua d'entrenament",
    "colorExplanation": "Els colors mostren els valors de les dades, neurones i pesos.",
    "showTestData": "Mostra dades de prova",
    "discretize": "Discretitza la sortida"
  },
  "article": {
    "whatIsNeuralNetwork": {
      "title": "Què és una Xarxa Neuronal?",
      "content": "És una tècnica per construir un programa d'ordinador que aprèn de les dades. Es basa vagament en com creiem que funciona el cervell humà. Primer, es crea una col·lecció de \"neurones\" digitals i es connecten entre si, permetent que s'enviïn missatges. A continuació, es demana a la xarxa que resolgui un problema, cosa que intenta fer una i altra vegada, cada vegada enfortint les connexions que porten a l'èxit i disminuint les que porten al fracàs. Per a una introducció més detallada a les xarxes neuronals, el llibre de Michael Nielsen <a href=\"http://neuralnetworksanddeeplearning.com/index.html\">Neural Networks and Deep Learning</a> és un bon lloc per començar. Per a una visió general més tècnica, prova <a href=\"http://www.deeplearningbook.org/\">Deep Learning</a> d'Ian Goodfellow, Yoshua Bengio i Aaron Courville."
    },
    "canIReuse": {
      "title": "M'encanta, puc reutilitzar-ho?",
      "content1": "Endavant! L'hem publicat com a codi obert a <a href=\"https://github.com/tensorflow/playground\">GitHub</a> amb l'esperança que pugui fer les xarxes neuronals una mica més accessibles i fàcils d'aprendre. Ets lliure d'utilitzar-lo de qualsevol manera que segueixi la nostra <a href=\"https://github.com/tensorflow/playground/blob/master/LICENSE\">Llicència Apache</a>. I si tens alguna suggerència per a addicions o canvis, si us plau <a href=\"https://github.com/tensorflow/playground/issues\">fes-nos-ho saber</a>. La traducció al català la trobareu <a href=\"https://github.com/yoelcabo/tf-playground-catala\">aquí</a>.",
      "content2": "També hem proporcionat alguns controls a sota per permetre't adaptar l'espai de joc a un tema o lliçó específica. Només tria quines característiques vols que siguin visibles a sota i després desa <a class=\"hide-controls-link\" href=\"#\">aquest enllaç</a>, o <a href=\"javascript:location.reload();\">refresca</a> la pàgina."
    },
    "colorMeaning": {
      "title": "Què volen dir tots aquests colors?",
      "content1": "El taronja i el blau s'utilitzen al llarg de la visualització de maneres lleugerament diferents, però en general el taronja mostra valors negatius mentre que el blau mostra valors positius.",
      "content2": "Els punts de dades (representats per petits cercles) estan inicialment acolorits en taronja o blau, que corresponen a 1 i -1.",
      "content3": "A les capes ocultes, les línies estan acolorides pels pesos de les connexions entre neurones. El blau mostra un pes positiu, el que significa que la xarxa està utilitzant aquesta sortida de la neurona tal com es dóna. Una línia taronja mostra que la xarxa està assignant un pes negatiu.",
      "content4": "A la capa de sortida, els punts estan acolorits en taronja o blau depenent dels seus valors originals. El color de fons mostra el que la xarxa està predient per a una àrea particular. La intensitat del color mostra com de confiada és aquesta predicció."
    },
    "whatLibrary": {
      "title": "Quina biblioteca heu utilitzat?",
      "content": "Hem creat una petita <a href=\"https://github.com/tensorflow/playground/blob/master/src/nn.ts\">biblioteca</a> de xarxes neuronals que compleix amb les demandes d'aquesta visualització educativa. Per a aplicacions més serioses, et recomanem <a href=\"https://www.tensorflow.org/\">TensorFlow</a>."
    },
    "credits": {
      "title": "Crèdits",
      "content": "El playground va ser creat per Daniel Smilkov i Shan Carter. És una continuació del treball previ de moltes persones — més notablement la <a href=\"http://cs.stanford.edu/people/karpathy/convnetjs/demo/classify2d.html\">demo de convnet.js</a> d'Andrej Karpathy i els <a href=\"http://colah.github.io/posts/2014-03-NN-Manifolds-Topology/\">articles</a> de Chris Olah sobre xarxes neuronals. Moltes gràcies també a D. Sculley per l'ajuda amb la idea original i a Fernanda Viégas i Martin Wattenberg i la resta dels seus equips a <a href=\"https://research.google.com/bigpicture/\">Big Picture</a> i <a href=\"https://research.google.com/teams/brain/\">Google Brain</a> pels comentaris i orientació.",
      "translation": "La traducció al català és a càrrec de'n <a href=\"https://yoel.cat\">Yoel Cabo</a>."
    }
  },
  "hovercard": {
    "clickToEdit": "Fes clic a qualsevol lloc per editar.",
    "weightBias": "Pes/Biaix"
  }
}